snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ВидыДопОбработки/ВидыДопОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДопОбработки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезОбработки</name>
      <description>Без обработки</description>
    </items>
    <items>
      <name>ЕвроКрючок</name>
      <description>Евро-крючок</description>
    </items>
    <items>
      <name>ЗаказыFBS_КонтрольКодовМаркировки</name>
      <description>Заказы FBS. Контроль кодов маркировки</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>ОтгрузкаУпаковкиОтдельно</name>
      <description>Отгрузка упаковки</description>
    </items>
    <items>
      <name>ПаллетаКроссДокинг</name>
      <description>Паллета КроссДокинг</description>
    </items>
    <items>
      <name>Паллетирование</name>
      <description>Паллетирование</description>
    </items>
    <items>
      <name>УпаковкаВКосметичку</name>
      <description>Упаковка в косметичку</description>
    </items>
    <items>
      <name>УпаковкаТовара</name>
      <description>Упаковка товара</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Неиспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьУпаковку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗаданиеНабора/ObjectModule.bsl
// Кухарь А.Ю. 03.06.2021 начало
//
Перем НеКонтролироватьОтгруженНакладных; 
// Кухарь А.Ю. 16.12.2021 начало
//
 
// Кухарь А.Ю. 16.12.2021 конец
Перем ДопПараметрыНакладной;
// Кухарь А.Ю. 03.06.2021 конец

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)<>Тип("ДокументСсылка.ПланНабора") Тогда Возврат КонецЕсли;
	
	Автор=ПараметрыСеанса.Пользователь;
	//+++Чирков 11.07.2025
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	//---Чирков 11.07.2025
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПланНабора") Тогда
		ДокументОснование=ДанныеЗаполнения;
		Если 1=2 Тогда
			ДанныеЗаполнения=Документы.ПланНабора.СоздатьДокумент();		
		КонецЕсли;		
		
		Склад	= ДанныеЗаполнения.Склад;
		
		Если ТипЗнч(ДанныеЗаполнения.Накладная)=Тип("ДокументСсылка.РасходнаяНакладная") Тогда			
			ИмяРеквизита="Контрагент";			
		Иначе
			ИмяРеквизита="СкладПолучатель";			
		КонецЕсли; 
				
		//// Кухарь А.Ю. 16.03.2021 начало
		//Перенёс в ПН. Потому что там ряд других реквизитов заполняется. Чтобы заполнять одним запросом
		////Получатель=ПолучитьРеквизитШапки(ДанныеЗаполнения.Накладная,ИмяРеквизита,"Документ");
		//СписокРеквизитов=Новый Соответствие;
		//СписокРеквизитов.Вставить(ИмяРеквизита,"Получатель");
		//СписокРеквизитов.Вставить("ДатаОтгрузки","ДатаОтгрузки");	
		//Реквизиты=ПолучитьРеквизитыШапки(Накладная,СписокРеквизитов,"Документ");
		//Получатель=Реквизиты.получатель;
		//ДатаОтгрузки=Реквизиты.ДатаОтгрузки;	
		//// Кухарь А.Ю. 16.03.2021 конец
		
		
		Товары.Очистить();
		Для Каждого СтрокаИст Из ДанныеЗаполнения.тБрэндов Цикл
			СтрокаПол=Товары.Добавить();			
			
			СтрокаПол.Номенклатура	= СтрокаИст.Коллекция;
			СтрокаПол.Количество	= СтрокаИст.Количество;
			//СтрокаПол.Единица		= СтрокаИст.
		КонецЦикла;
		
		//  25.08.2020 кухарь начало
		СозданоОбработкойПополнения = ДанныеЗаполнения.СозданоОбработкойПополнения; 
		//  25.08.2020 кухарь конец
		
		
	КонецЕсли; 	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)        
	
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105 
	
	//Если ЗагруженИзТСД=Истина Или СостояниеНакладной=Перечисления.СостоянияНакладной.ГотоваКОтгрузке или  СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда
	Если ЗагруженИзТСД Тогда  //07.04.2026 Тимофеев Ю.А.
		
		МассСтрокПН=ДокументОснование.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти",НомерЧасти)); 
		
		ADRESS.СнятьЗанятостьСотрудника(МассСтрокПН,,Строка(Ссылка)+" ЗНБ готов к отгрузке"); 
		 		
	КонецЕсли;
	//https://yougile.collant.ru/team/ab6bad3a05c0/#SNL-105

	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	// Кухарь А.Ю.  19.09.2024 начало
	//
	//Если ЗначениеЗаполнено(КодТСД) Тогда
	//	УзелТСД=ПланыОбмена.МобильныеТСД.НайтиПоКоду(КодТСД);	
	//	Если УзелТСД.Пустая() Тогда
	//		СообщитьОбОшибке("Не найден узел ТСД с кодом: """+КодТСД+"""",Отказ);			
	//		Возврат;
	//	КонецЕсли; 
	//	ЗарегистрироватьОбъектыКВыгрузке(УзелТСД);			
	//КонецЕсли;
	 
	// Кухарь А.Ю.  19.09.2024 конец
	
	
	// Кухарь А.Ю. 29.07.2020 начало
	// теперь ожидание набора - это стартовое состояние, которое устанавливается из ПН. Обновлять ничего не нужно
	//Если СостояниеНакладной=Перечисления.СостоянияНакладной.ПроверенаПоОстаткам
	//	ИЛИ СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
	//	ОбновитьСостоянияСтрокПН();			
	//КонецЕсли; 	 
	// Кухарь А.Ю. 29.07.2020 конец
	
	// Ихсанов Д. А. Начало 18.11.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7714
	////////// ВРЕМЕННО ОБРАБОТЧИК НАХОДИТСЯ ЗДЕСЬ, ДАЛЕЕ ОН ДОЛЖЕН БЫТЬ ПЕРЕНЕСЕН В
	////////// ПРОРАБОТАННУЮ ОЧЕРЕДЬ НА СОЗДАНИЕ ДОКУМЕНТОВ
	//Валетов + 26,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7983
	//Почти все реквизиты есть только если основание РНК. Добавил проверку на тип.
	Если ТипЗнч(Накладная) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);
		
		РеквизитыРасходнойНакладной = ЗначенияРеквизитовОбъекта(Накладная,
			"СостояниеНакладной, ОтгрузкаКомплектов, Контрагент, ОтгрузкаЗаказовПоЮрЛицу, ПунктДоставки");
		Если (СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки
				Или СостояниеНакладной = Перечисления.СостоянияНакладной.ДопОбработка
				// Ихсанов Д. А. Начало 11.06.2026 Изменение 0000000059 от 02.06.2026 16:43:23: e1cib/data/Документ.Изменение?ref=89690050568f680711f15e8905fd02ab
				//Или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования И ЗагруженИзТСД))
				Или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования))
				// Ихсанов Д. А. Конец 11.06.2026
			// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000240 от 06.07.2026 10:31:10: e1cib/data/Документ.Изменение?ref=896d0050568f680711f1790ca80af2c3
			//И Накладная.ДопОбработки.Найти(Справочники.ВидыДопОбработки.ЗаказыFBS_ОтЮрЛиц, "ВидДопОбработки") <> Неопределено
			И Накладная.ДопОбработки.Найти(Справочники.ВидыДопОбработки.ЗаказыFBS_КонтрольКодовМаркировки, "ВидДопОбработки") <> Неопределено
			// Ихсанов Д. А. Конец 07.07.2026
			И РеквизитыРасходнойНакладной.ОтгрузкаКомплектов
			И (РеквизитыРасходнойНакладной.ОтгрузкаЗаказовПоЮрЛицу
			// Ихсанов Д. А. Начало 18.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
			// С 01.01.2026 Озон может обязать прикреплять маркировку по всем заказам
				Или ДопПараметрыНакладной.Озон_МаркировкаПоВсемЗаказам)
			// Ихсанов Д. А. Конец 18.12.2025
			И ОбменМаркетПлейс.КонтрагентУчастникМаркетПлейса(РеквизитыРасходнойНакладной.Контрагент,
				РеквизитыРасходнойНакладной.ПунктДоставки) Тогда
			ОбменМаркетПлейс.СоздатьОперациюМаркировкиСФормированиемНаборов(Накладная);
		КонецЕсли;  
	КонецЕсли;
	// Ихсанов Д. А. Конец 18.11.2025
	
КонецПроцедуры

Процедура ОбновитьСостоянияСтрокПН()
	ТекНомер=ПолучитьНомерСостоянияНакладной(СостояниеНакладной);
	ПН_Объект=ДокументОснование.ПолучитьОбъект();	
	Для Каждого СтрокаПН Из ПН_Объект.тБрэндов Цикл
		Если СтрокаПН.НомерЧасти=НомерЧасти И ТекНомер>ПолучитьНомерСостоянияНакладной(СтрокаПН.Состояние) Тогда
			//Кухарь 24.12.19 начало
			//Иногда записывать ПН не нужно а при установке состояния даже на такое же, модифицированность устанавливается
			если СтрокаПН.Состояние=СостояниеНакладной тогда
				Продолжить;
			КонецЕсли;
			//Кухарь 24.12.19 конец
			
			СтрокаПН.Состояние=СостояниеНакладной;	
		КонецЕсли; 	
	КонецЦикла; 
	
	Если ПН_Объект.Модифицированность() Тогда
		ПН_Объект.Записать();	
	КонецЕсли; 
КонецПроцедуры


Функция ЗарегистрироватьИзменения(Узел,Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел,Значение);	
	КонецЕсли;
КонецФункции // ()

Процедура ЗарегистрироватьОбъектыКВыгрузке(УзелТСД)
	ТЧ=Товары.Выгрузить();
	// Кухарь А.Ю. 16.01.2020 начало
	//  	ТЧ.Свернуть("Номенклатура,Единица");
	ТЧ.Свернуть("Номенклатура"); 
	// Кухарь А.Ю. 16.01.2020 конец
	
	
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		ЗарегистрироватьИзменения(УзелТСД,СтрокаТЧ.Номенклатура);	
		// Кухарь А.Ю. 16.01.2020 начало
		//ЗарегистрироватьИзменения(УзелТСД,СтрокаТЧ.Единица);
		// Кухарь А.Ю. 16.01.2020 конец	
	КонецЦикла; 
	
	ЗарегистрироватьИзменения(УзелТСД,Автор);
	ЗарегистрироватьИзменения(УзелТСД,Склад);
	ЗарегистрироватьИзменения(УзелТСД,Ссылка);
КонецПроцедуры

Процедура ЗаполнитьОбъемы()
	ШаблонРеквизитов=Новый Соответствие();
	ШаблонРеквизитов.Вставить("Родитель.ШтукВКоробке","ШтукВКоробке");
	ШаблонРеквизитов.Вставить("Родитель.ОбъемКоробки","ОбъемКоробки");
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Реквизиты=ПолучитьРеквизитыШапки(СтрокаТЧ.Номенклатура,ШаблонРеквизитов);
		СтрокаТЧ.Объем=СтрокаТЧ.Количество*Реквизиты.ОбъемКоробки/?(ЗначениеЗаполнено(Реквизиты.ШтукВКоробке),Реквизиты.ШтукВКоробке,1);		
	КонецЦикла;	 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);	 
	ДопПараметрыНакладной= ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Накладная);

	
	РеквизитыНакладной= ПолучитьРеквизитыШапки(Накладная,Новый Структура("СостояниеНакладной,Проведен"),"Документ");
	НакладнаяСостояние	=РеквизитыНакладной.СостояниеНакладной; 
	НакладнаяПроведен				=РеквизитыНакладной.проведен;
	если НакладнаяСостояние=Перечисления.СостоянияНакладной.Отгружена тогда
		если НеКонтролироватьОтгруженНакладных<>Истина тогда
			если СостояниеНакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
				СообщитьИзМодуля("Нельзя записывать ЗНБ отгруженной накладной, в состоянии отличном от Отгружено.");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	если ЭтоНовый() тогда					
		если ДокументОснование.Метаданные().Имя="ПланНабора" и ДокументОснование.СозданоОбработкойПополнения тогда
			СозданоОбработкойПополнения=Истина;
		КонецЕсли;
		
		если НакладнаяСостояние=Перечисления.СостоянияНакладной.Отгружена тогда
			СообщитьИзМодуля("Нельзя создавать ЗНБ к отгруженным накладным");	
			отказ = Истина;			
		КонецЕсли; 
		
		если не НакладнаяПроведен тогда
			СообщитьИзМодуля("Нельзя создавать ЗНБ к непроведённым накладным");	
			отказ = Истина;			
		КонецЕсли; 		
		НачСостНакладной=Неопределено;
		
		//+++Чирков 10.02.2026
		ДатаСоздания = ТекущаяДата();
		//---Чирков 10.02.2026
	Иначе
		НачРеквизиты= ПолучитьРеквизитыШапки(Ссылка,Новый Структура("СостояниеНакладной,Дата"),"Документ");
		НачСостНакладной	=НачРеквизиты.СостояниеНакладной; 
		НачДата				=НачРеквизиты.дата;
		
		если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
			если не НакладнаяПроведен тогда
				СообщитьИзМодуля("Нельзя создавать ЗНБ к непроведённым накладным");	
				отказ = Истина;			
			КонецЕсли; 		
		КонецЕсли;
		
		// Кухарь А.Ю.  11.11.2024 начало
		//
		если НачСостНакладной=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ или НачСостНакладной=Перечисления.СостоянияНакладной.КомплектацияЧЗ тогда
			если ПолучитьНомерСостоянияНакладной(СостояниеНакладной)>755 тогда
				ФормированиеНаборовЧЗЗавершено = Истина;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  11.11.2024 конец
		
		
	КонецЕсли; 
	
	если ЭтоНовый() и Накладная.Метаданные().Имя="Перемещение" 
		и (накладная.Склад.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада или накладная.СкладПолучатель.ВидСклада=Перечисления.ВидСклада.ВиртуальныйДляСклада )
		 и не СозданоОбработкойПополнения 
		тогда	
		СообщитьИзМодуля("Для внутренних перемещений ЗНБ не нужны.");	
		отказ = Истина;
	КонецЕсли;
	
	
	если Проведен и РежимЗаписи=РежимЗаписиДокумента.Запись и НачСостНакладной<>Перечисления.СостоянияНакладной.ВНаборе
		и СостояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе тогда	 
		Дата=ТекущаяДата();
		РежимЗаписи=РежимЗаписиДокумента.Проведение;
	КонецЕсли; 
	
	если ЭтоНовый() и не Накладная.Проведен  и не СозданоОбработкойПополнения тогда
		СообщитьИзМодуля("Нельзя создавать ЗНБ к распроведённым накладным.");
		Отказ=Истина;		
	КонецЕсли;	 
	
	если не ЭтоНовый() и СостояниеНакладной<>Перечисления.СостоянияНакладной.ОжиданиеНабора 
			и СостояниеНакладной<>Перечисления.СостоянияНакладной.ПолученоСкладом 
			и СостояниеНакладной<>Перечисления.СостоянияНакладной.СформированыЗаданияНабора
			 и СостояниеНакладной<>Перечисления.СостоянияНакладной.Отгружена
			тогда	 
		
		СписокДоступныхСостояний = ПроверитьБлокировкуВыдачейВНабор(Ссылка);
		если СписокДоступныхСостояний <> Неопределено тогда
	 
			если СписокДоступныхСостояний.найти(НачСостНакладной) = Неопределено и НачСостНакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
				Сообщить("Накладная заблокирована для изменений документом: Блокировка выдачи в набор");
				отказ=Истина;
			ИначеЕсли 	СписокДоступныхСостояний.найти(СостояниеНакладной) = Неопределено и СостояниеНакладной<> Перечисления.СостоянияНакладной.Отгружена тогда
				Сообщить("Накладную нельзя записать в текущем статусе. Данный статус накладной запрещён документом: Блокировка выдачи в набор");
				отказ=Истина;
			КонецЕсли;
		КонецЕсли;			

	КонецЕсли;
	//++Данилова Е.В. 28.01.2026 SNL-109
	Если не ЭтоНовый() Тогда 
		
		Если СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеНабора
			И НачСостНакладной <>Перечисления.СостоянияНакладной.ОжиданиеНабора Тогда
			
			РезПроверки = Обработки.ПланИнвентаризации.ПроверитьДокументНаОтсутствиеБлокировок(ссылка);
			
			Если Не РезПроверки.Успех Тогда
				
				Сообщить("Накладная заблокирована для смены статуса в ""ожидание набора"" документом: Блокировка выдачи в набор. Заблокированные товары:");
				Сообщить(СтрСоединить(РезПроверки.Ошибки,Символы.ПС));
				//++Данилова Е.В. 11.03.2026 SNL-159 
				Если ЗначениеЗаполнено(РезПроверки.ДопТекстОшибки) Тогда
				
					Сообщить(РезПроверки.ДопТекстОшибки); 	
				
				КонецЕсли;
				//--Данилова Е.В. 11.03.2026 
				
				Отказ = истина; 
				
			КонецЕсли;
			
		КонецЕсли;
		//++Данилова Е.В. 25.02.2026  HELP-8893
		РазделениеЗНБ = ДополнительныеСвойства.Свойство("РазделениеЗНБ") И  ДополнительныеСвойства.РазделениеЗНБ; 
		Если НачСостНакладной = Перечисления.СостоянияНакладной.ОжиданиеНабора 
			И НЕ РазделениеЗНБ Тогда 
		//--Данилова Е.В. 25.02.2026 
			
			РезПроверки = Обработки.ПланИнвентаризации.ПроверитьЗНБОжиданиеНабора(ссылка);
			
			Если Не РезПроверки.Успех Тогда
				
				Сообщить("Накладная заблокированав статусе ""ожидание набора"" документом: Блокировка выдачи в набор. необходимо отложить коробку до окончания ИНВ");
				Сообщить("Заблокированные товары:" + Символы.ПС + СтрСоединить(РезПроверки.Ошибки,Символы.ПС) );
				
				Отказ = истина; 
				
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЕсли;
	//--Данилова Е.В. 28.01.2026 
	
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		ПланируемыеСостояния.Очистить();			
	иначеесли СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеНабора или СостояниеНакладной=Перечисления.СостоянияНакладной.ВНаборе  или ПланируемыеСостояния.Количество()=0   тогда 		
		если  СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеНабора тогда
			ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);	
		КонецЕсли;
		ЗаполнитьТЧПланируемыеСостояния();
	КонецЕсли;
	
	если СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена тогда
		Отгружен=Перечисления.Отгружен.Отгружен;
	иначе
		Отгружен=Перечисления.Отгружен.Резерв;
	КонецЕсли; 
	
	Если Модифицированность() Тогда
		КоличествоДокумента = Товары.Итог("Количество");
		ОбъемДокумента		= Товары.Итог("Объем");
	КонецЕсли;	  
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	ДвиженияПоРегистрам=Неопределено;
	
	Если СостояниеНакладной=Перечисления.СостоянияНакладной.СформированыЗаданияНабора 
		или СостояниеНакладной=Перечисления.СостоянияНакладной.ПроверенаПоОстаткам 
		или СостояниеНакладной=Перечисления.СостоянияНакладной.ОжиданиеНабора	 
		или СостояниеНакладной=Перечисления.СостоянияНакладной.ПолученоСкладом	 
		Или СостояниеНакладной=Перечисления.СостоянияНакладной.Отменена	 
		или СостояниеНакладной=Перечисления.СостоянияНакладной.ПустаяСсылка() 
		ИЛИ СостояниеНакладной=Перечисления.СостоянияНакладной.Отгружена Тогда
		Возврат;	
	КонецЕсли;

	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам);	
	
	Результат=РезультатПроведения["Результат"];
	
	Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда		
		Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));		
		
		ВывестиТрассировку(РезультатПроведения["ТОшибок"],?(Отказ,-2,Результат));			
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;		
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

// Кухарь А.Ю. 16.01.2020 начало
// Заполним состояния
Процедура ЗаполнитьТЧПланируемыеСостояния ()
	// Кухарь А.Ю. 24.08.2020 начало
	// Особые ЗНБ, заполнять будем в той же обработке, где создали
	если СозданоОбработкойПополнения тогда 
		ЗаполнитьТЧПланируемыеСостоянияДляПополнения();
		Возврат;
	КонецЕсли;
	// Кухарь А.Ю. 24.08.2020 конец
	
	ВидНакладной=Накладная.Метаданные().Имя;	
	
	если  ВидНакладной = "Комплектация" тогда
		ЗаполнитьТЧПланируемыеСостоянияДляКМП();
	КонецЕсли;
	
	//если ДопПараметрыНакладной<>Неопределено и (ДопПараметрыНакладной.ОтгрузкаFBS или ДопПараметрыНакладной.НаборТовараПоЕдинойСхеме)  тогда	  
	//	ЕстьБельё=ложь;
	//иначе
	//	ЕстьБельё=ЭтоБельё(ДокументОснование,НомерЧасти,"ЗНБ");	
	//КонецЕсли;	
	
	ЕстьБельё=Ложь;
	
	ИспользоватьЛНТолькоДляНабора = ИспользоватьЛНТолькоДляНабора(Накладная); // Кельманов А.В. - SNL-119 - 2026.03.03
	
	Если ВидНакладной="Комплектация" тогда
		ТребуетсяДО=ложь;
		НужноПаллетирование = ложь;
		НужнаТермоусадка = ложь;	
		НужнаПереукладка = ложь;
	Иначе	
		
		СписокРеквизитов=Новый Структура("НужноПаллетирование,НужнаТермоусадка");	 	
		РеквизитыСсылки=ПолучитьРеквизитыШапки(Накладная,СписокРеквизитов,"Документ");			
		ТребуетсяДО=ТребуетсяДопОбработка(Накладная);
		НужноПаллетирование=РеквизитыСсылки.НужноПаллетирование;
		НужнаТермоусадка=РеквизитыСсылки.НужнаТермоусадка;
		НужнаПереукладка=Истина; //Это определяется оператором, возможно он создаст ЛП, а возможно нет. Будем добавлять строчку с галкой пропускать, а при создании ЛП будем эту галку снимать.
	КонецЕсли;
	
	ПланируемыеСостояния.Очистить();
	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ПолученоСкладом;
	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.СформированыЗаданияНабора;
		
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора;
	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ВНаборе;
	
	Если ЕстьБельё И ТребуетсяДО Тогда
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 { 
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если ИспользоватьЛНТолькоДляНабора Тогда
		Если ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 }
		
			СтрТЧ.Пропустить = Истина;    
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 { 
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если ИспользоватьЛНТолькоДляНабора Тогда
		Если ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 } 
		
			СтрТЧ.Пропустить = Истина;       
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.ДопОбработка;
		
	КонецЕсли;
	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования;
	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Сканирование;
	
	// Кухарь А.Ю.  27.02.2025 начало
	если не ДопПараметрыНакладной.НаборыЧЗбезОклейкиКомплектующих тогда
		// Кухарь А.Ю.  27.02.2025 конец
		
		// Кухарь А.Ю.  06.11.2024 начало
		//
		если ТребуетсяФормированиеНабораЧЗ тогда
			СтрТЧ=ПланируемыеСостояния.Добавить();
			СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеКомплектацииЧЗ;
			
			СтрТЧ=ПланируемыеСостояния.Добавить();
			СтрТЧ.Состояние=Перечисления.СостоянияНакладной.КомплектацияЧЗ;	
		КонецЕсли;
		// Кухарь А.Ю.  06.11.2024 конец
		
		// Кухарь А.Ю.  27.02.2025 начало
	КонецЕсли;
	// Кухарь А.Ю.  27.02.2025 конец
	
	Если Не ЕстьБельё И ТребуетсяДО Тогда
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 {
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если ИспользоватьЛНТолькоДляНабора Тогда
		Если ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 }
		
			СтрТЧ.Пропустить = Истина; 
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.ОжиданиеДопОбработки;
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 {
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если ИспользоватьЛНТолькоДляНабора Тогда
		Если ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 }
		
			СтрТЧ.Пропустить = Истина;   
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.ДопОбработка;		
		
	КонецЕсли;
	
	Если НужнаПереукладка Тогда   
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 {
		//СтрТЧ.Пропустить = Истина;
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если Не ИспользоватьЛНТолькоДляНабора Тогда
		Если Не ИспользоватьЛНТолькоДляНабора Или Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 }
		
			СтрТЧ.Пропустить = Истина;
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.ОжиданиеПереукладки;		
		
		СтрТЧ = ПланируемыеСостояния.Добавить();
		
		// Кельманов А.В. - SNL-119 - 2026.03.03 {
		//СтрТЧ.Пропустить = Истина;
		
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 {
		//Если Не ИспользоватьЛНТолькоДляНабора Тогда
		Если Не ИспользоватьЛНТолькоДляНабора Или Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		// Кельманов А.В. - ИЗМ-0000000137 - 2026.06.16 }
		
			СтрТЧ.Пропустить = Истина; 
			
		КонецЕсли;
		// Кельманов А.В. - SNL-119 - 2026.03.03 }
		
		СтрТЧ.Состояние = Перечисления.СостоянияНакладной.Переукладка;
		
	КонецЕсли;	
	
	если НужнаТермоусадка тогда
		СтрТЧ=ПланируемыеСостояния.Добавить();
		СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеТермоусадки;
		
		СтрТЧ=ПланируемыеСостояния.Добавить();
		СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Термоусадка;		
	КонецЕсли;
	
	если НужноПаллетирование тогда
		СтрТЧ=ПланируемыеСостояния.Добавить();
		СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
		
		СтрТЧ=ПланируемыеСостояния.Добавить();
		СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Паллетирование;		
	КонецЕсли;          

	//Кухарь А.Ю.  31.10.2025 начало
	// HELP-5404             
	//Если ТребуетсяМаркировка Тогда 
	ПереводитьВОжиданиеОбработкиЧЗ = ложь;
	если ВидНакладной = "РасходнаяНакладная" тогда     
		ПереводитьВОжиданиеОбработкиЧЗ=ОбщегоНазначения_ПИ.ПолучитьЗначениеРСРеквизитыСправочников(Получатель,"ПереводитьВОжиданиеОбработкиЧЗ",Ложь);
	КонецЕсли;	
	//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404    	
	Если ТребуетсяМаркировка и ПереводитьВОжиданиеОбработкиЧЗ Тогда 
	//Кухарь А.Ю.  31.10.2025 конец		
		СтрТЧ=ПланируемыеСостояния.Добавить();
		СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ;
	КонецЕсли;
	//Валетов-
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;		
	
	//Наверное не буду добавлять, чтобы только руками ставим
	//СтрТЧ=ПланируемыеСостояния.Добавить();
	//СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Отгружена;		
	
КонецПроцедуры
// Кухарь А.Ю. 16.01.2020 конец	

// Кухарь А.Ю. 24.08.2020 начало
// У пополнения состояния другие
Процедура ЗаполнитьТЧПланируемыеСостоянияДляПополнения()		
	ПланируемыеСостояния.Очистить();	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора;	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ВНаборе;	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;		
КонецПроцедуры
// Кухарь А.Ю. 24.08.2020 конец

// Кухарь А.Ю. 18.01.2021 начало
// У КМП состояния другие
Процедура ЗаполнитьТЧПланируемыеСостоянияДляКМП()		
	ПланируемыеСостояния.Очистить();	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеНабора;	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ВНаборе;	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ОжиданиеСканирования;	
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.Сканирование;		
	СтрТЧ=ПланируемыеСостояния.Добавить();
	СтрТЧ.Состояние=Перечисления.СостоянияНакладной.ГотоваКОтгрузке;		
КонецПроцедуры
 
// Кухарь А.Ю. 18.01.2021 конец

// Кухарь А.Ю. 03.06.2021 начало
//
Процедура ЗаписатьЗНББезКонтроляСостояний(РежимЗаписи) экспорт
	НеКонтролироватьОтгруженНакладных=Истина;
	Записать(РежимЗаписи);
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
// Кухарь А.Ю. 03.06.2021 конец
